In [2]:
import pandas as pd

data = {
'Coffee_Shop_Name': ['HollyBrew', 'Diego Drip', 'NY Espresso', 'Holly Beans', 'Diego Morning', 'NY Caffeine', 'Diego Delight'],
'Location': ['Hollywood', 'San Diego', 'New York', 'Hollywood', 'San Diego', 'New York', 'San Diego'],
'Rating_out_of_5': [4.5, 4.1, 4.0, 4.7, 4.3, 4.4, 4.2],
'Visitors_per_day': [320, 290, 500, 330, 280, 520, 270]
}

df = pd.DataFrame(data)
df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              4.1               290
2      NY Espresso   New York              4.0               500
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              4.3               280
5      NY Caffeine   New York              4.4               520
6    Diego Delight  San Diego              4.2               270

# a_LOC

In [3]:
# Retrieve all the rows for coffee shops located in "Hollywood".
# Change the rating of "Diego Drip" to 5.0 using the loc method.
# Select the 'Rating_out_of_5' for the coffee shop named "NY Espresso".
# Get the 'Visitors_per_day' values for coffee shops that have a rating greater than 4.2.
# Update the 'Location' of "NY Caffeine" to "Brooklyn".
# ================================================
# Retrieve all coffee shops where 'Visitors_per_day' is over 400.
# Find the 'Rating_out_of_5' for coffee shops named "Diego Brew" and "Holly Coffee".
# Update the 'Coffee_Shop_Name' of the shop located in "Hollywood" with a rating of 4.0 to "HollyBuzz Cafe".
# Select shops located in "San Diego" with a rating less than or equal to 4.2.
# Get the 'Coffee_Shop_Name' and 'Rating_out_of_5' for shops that receive between 200 and 400 visitors per day.

In [4]:
# Retrieve all the rows for coffee shops located in "Hollywood".
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Coffee_Shop_Name  7 non-null      object
 1   Location          7 non-null      object
 2   Rating_out_of_5   7 non-null      float64
 3   Visitors_per_day  7 non-null      int64
dtypes: float64(1), int64(1), object(2)
memory usage: 352.0+ bytes

In [5]:
df.loc[df['Location'] == 'Hollywood']

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
3      Holly Beans  Hollywood              4.7               330

In [6]:
# Change the rating of "Diego Drip" to 5.0 using the loc method.
df.loc[df['Coffee_Shop_Name'] == 'Diego Drip', 'Rating_out_of_5'] = 5.0
df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              5.0               290
2      NY Espresso   New York              4.0               500
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              4.3               280
5      NY Caffeine   New York              4.4               520
6    Diego Delight  San Diego              4.2               270

In [7]:
# Select the 'Rating_out_of_5' for the coffee shop named "NY Espresso".
df.loc[df['Coffee_Shop_Name'] == 'NY Espresso']['Rating_out_of_5']

2    4.0
Name: Rating_out_of_5, dtype: float64

In [8]:
# Get the Visitors_per_day'Visitors_per_day' values for coffee shops that have a rating greater than 4.2.
df.loc[df['Rating_out_of_5'] > 4.2]['Visitors_per_day']

0    320
1    290
3    330
4    280
5    520
Name: Visitors_per_day, dtype: int64

In [9]:
# Update the 'Location' of "NY Caffeine" to "Brooklyn".
df.loc[df['Coffee_Shop_Name'] == 'NY Caffeine', 'Location'] = 'Brooklyn'
df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              5.0               290
2      NY Espresso   New York              4.0               500
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              4.3               280
5      NY Caffeine   Brooklyn              4.4               520
6    Diego Delight  San Diego              4.2               270

# b_iLOC

In [10]:
# Get the details of the first coffee shop in the DataFrame.
# Retrieve the names and ratings of the first three coffee shops.
# Extract the ratings for the last two coffee shops.
# Update the 'Visitors_per_day' for the third coffee shop to 505 using iloc.
# Fetch the details for coffee shops at even indices.
# ===================================================

# Extract the names of the last three coffee shops in the DataFrame.
# Update the 'Rating_out_of_5' for the fifth coffee shop to 4.6.
# Get the details of the coffee shop at index 3.
# Fetch the 'Location' and 'Visitors_per_day' for the coffee shops at indices 2, 4, and 6.
# Retrieve the rating of the second-to-last coffee shop in the DataFrame.

In [11]:
# Get the details of the first coffee shop in the DataFrame.
df.iloc[0]

Coffee_Shop_Name    HollyBrew
Location            Hollywood
Rating_out_of_5           4.5
Visitors_per_day          320
Name: 0, dtype: object

In [12]:
# Retrieve the names and ratings of the first three coffee shops.
df.iloc[:3, 0]

0      HollyBrew
1     Diego Drip
2    NY Espresso
Name: Coffee_Shop_Name, dtype: object

In [13]:
# Extract the ratings for the last two coffee shops.
df.iloc[-2:, 2]

5    4.4
6    4.2
Name: Rating_out_of_5, dtype: float64

In [14]:
# Update the 'Visitors_per_day' for the third coffee shop to 505 using iloc.
df.iloc[2, 3] = 505
df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              5.0               290
2      NY Espresso   New York              4.0               505
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              4.3               280
5      NY Caffeine   Brooklyn              4.4               520
6    Diego Delight  San Diego              4.2               270

In [15]:
# Fetch the details for coffee shops at even indices.
df.iloc[(i for i in df.index if i%2 ==0)]

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
2      NY Espresso   New York              4.0               505
4    Diego Morning  San Diego              4.3               280
6    Diego Delight  San Diego              4.2               270

# c_COUNT

In [16]:
# How many coffee shops are there in each location?
# Count the number of coffee shops with a rating above 4.5.
# How many coffee shops receive more than 300 visitors per day?
# Count the number of coffee shops with names containing the word "Diego".
# How many unique locations are there in the DataFrame?
# ================================================

# How many coffee shops have a name that starts with "Holly"?
# Count the number of coffee shops with a rating of exactly 4.0.
# How many coffee shops in "New York" have a rating above 4.5?
# Count the number of coffee shops that receive fewer than 250 visitors per day.
# How many coffee shops in "San Diego" receive more than 350 visitors daily?

In [17]:
# How many coffee shops are there in each location?
df.Location.value_counts()

San Diego    3
Hollywood    2
New York     1
Brooklyn     1
Name: Location, dtype: int64

In [18]:
# Count the number of coffee shops with a rating above 4.5.
df[df['Rating_out_of_5'] > 4.5].shape

(2, 4)

In [19]:
# How many coffee shops receive more than 300 visitors per day?
df[df['Visitors_per_day'] > 300].shape[0]

4

In [20]:
# Count the number of coffee shops with names containing the word "Diego".
df[df['Coffee_Shop_Name'].str.contains('Diego')].shape[0]

3

In [21]:
# How many unique locations are there in the DataFrame?
df.Location.nunique()

4

In [22]:
df.Location.unique()

array(['Hollywood', 'San Diego', 'New York', 'Brooklyn'], dtype=object)

# d_SIZE

In [23]:
# What's the size (number of elements) of the 'Rating_out_of_5' column?
# Calculate the size of the DataFrame after filtering for coffee shops in "San Diego".
# Determine the size of the DataFrame when you only consider the 'Coffee_Shop_Name' and 'Rating_out_of_5' columns.
# What's the size of the DataFrame after dropping the 'Visitors_per_day' column?
# Calculate the size of the DataFrame after selecting only the first 4 rows.
# ===================================================

# Calculate the size of the DataFrame after filtering for coffee shops in "New York".
# What's the size of the DataFrame when you only consider the 'Location' and 'Visitors_per_day' columns?
# Determine the size of the 'Rating_out_of_5' column after dropping any duplicate ratings.
# How many elements are there in the DataFrame after dropping the first two rows?
# Calculate the size of the DataFrame after selecting only the last 5 rows

In [24]:
# What's the size (number of elements) of the 'Rating_out_of_5' column?
df['Rating_out_of_5'].size

7

In [25]:
# Calculate the size of the DataFrame after filtering for coffee shops in "San Diego".
df[df['Location'] == 'San Diego'].size

12

In [26]:
# Determine the size of the DataFrame when you only consider the 'Coffee_Shop_Name' and 'Rating_out_of_5' columns.
df[['Coffee_Shop_Name', 'Rating_out_of_5']].size

14

In [27]:
# What's the size of the DataFrame after dropping the 'Visitors_per_day' column?
df.drop(columns = 'Visitors_per_day').size

21

In [28]:
# Calculate the size of the DataFrame after selecting only the first 4 rows.
df[:4].size

16

In [29]:
# Calculate the size of the DataFrame after filtering for coffee shops in "New York".
# What's the size of the DataFrame when you only consider the 'Location' and 'Visitors_per_day' columns?
# Determine the size of the 'Rating_out_of_5' column after dropping any duplicate ratings.
# How many elements are there in the DataFrame after dropping the first two rows?
# Calculate the size of the DataFrame after selecting only the last 5 rows

# e_NULLs

In [30]:
# Are there any missing values in the 'Rating_out_of_5' column?

# If there were missing values in the 'Visitors_per_day' column, how would you fill them with the average of the column?

# Drop any rows where there might be missing values (if there were any).

# If there were any missing values in the 'Location' column, how would you forward-fill them?

# Replace any NaN values in the 'Rating_out_of_5' column with the median rating (if there were any).
# ======================================================

# f there were missing values in the 'Rating_out_of_5' column, how would you back-fill them?

# Count the number of missing values in each column (if there were any).

# Drop any columns that might have missing values (if there were any).

# Replace NaN values in 'Visitors_per_day' with a constant value, say 300 (if there were any).

# How would you find out which coffee shops have missing values in the 'Rating_out_of_5' column (if there were any)?

In [31]:
df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              5.0               290
2      NY Espresso   New York              4.0               505
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              4.3               280
5      NY Caffeine   Brooklyn              4.4               520
6    Diego Delight  San Diego              4.2               270

In [32]:
df['Rating_old'] = [2, None, 2, None, None, None, 3]

In [33]:
df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day  Rating_old
0        HollyBrew  Hollywood              4.5               320         2.0
1       Diego Drip  San Diego              5.0               290         NaN
2      NY Espresso   New York              4.0               505         2.0
3      Holly Beans  Hollywood              4.7               330         NaN
4    Diego Morning  San Diego              4.3               280         NaN
5      NY Caffeine   Brooklyn              4.4               520         NaN
6    Diego Delight  San Diego              4.2               270         3.0

In [34]:
# Are there any missing values in the 'Rating_out_of_5' column?
df['Rating_out_of_5'].isna().sum()

0

In [35]:
# If there were missing values in the 'Visitors_per_day' column, how would you fill them with the average of the column?
df['Visitors_per_day'].fillna(df['Visitors_per_day'].mean())

0    320
1    290
2    505
3    330
4    280
5    520
6    270
Name: Visitors_per_day, dtype: int64

In [36]:
# Drop any rows where there might be missing values (if there were any).
df.dropna()

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day  Rating_old
0        HollyBrew  Hollywood              4.5               320         2.0
2      NY Espresso   New York              4.0               505         2.0
6    Diego Delight  San Diego              4.2               270         3.0

In [37]:
# If there were any missing values in the 'Location' column, how would you forward-fill them?
df['Location'].fillna(method = 'ffill')

0    Hollywood
1    San Diego
2     New York
3    Hollywood
4    San Diego
5     Brooklyn
6    San Diego
Name: Location, dtype: object

In [38]:
# Replace any NaN values in the 'Rating_out_of_5' column with the median rating (if there were any).
df['Rating_out_of_5'].fillna(df['Rating_out_of_5'].median)

0    4.5
1    5.0
2    4.0
3    4.7
4    4.3
5    4.4
6    4.2
Name: Rating_out_of_5, dtype: float64

In [39]:
# f there were missing values in the 'Rating_out_of_5' column, how would you back-fill them?
# Count the number of missing values in each column (if there were any).
# Drop any columns that might have missing values (if there were any).
# Replace NaN values in 'Visitors_per_day' with a constant value, say 300 (if there were any).
# How would you find out which coffee shops have missing values in the 'Rating_out_of_5' column (if there were any)?

# f___unique_N_unique

In [40]:
# How many unique coffee shops are there in the 'Coffee_Shop_Name' column of the dataset?
# Which column has the fewest unique values?
# How many unique ratings are present in the 'Rating_out_of_5' column?
# Find out how many unique daily visitor counts are recorded in the dataset.
# Determine the number of unique locations in which the coffee shops are situated.
# ===================================================
# Check if there are any coffee shop names that only appear once in the dataset.
# How many unique values does the 'Opening_Hours' column contain?
# Are all coffee shops in Hollywood unique or are there duplicates?
# Which city, Hollywood or San Diego, has a greater number of unique coffee shops?
# How many different combinations of 'Rating_out_of_5' and 'Location' exist in the dataset? (Hint: Check unique pairs)

In [41]:
# How many unique coffee shops are there in the 'Coffee_Shop_Name' column of the dataset?
df["Coffee_Shop_Name"].nunique()

7

In [42]:
# Which column has the fewest unique values?
df.nunique().sort_values().to_frame().index[0]

'Rating_old'

In [43]:
# How many unique ratings are present in the 'Rating_out_of_5' column?
df['Rating_out_of_5'].nunique()

7

In [44]:
# Find out how many unique daily visitor counts are recorded in the dataset.
df['Visitors_per_day'].nunique()

7

In [45]:
# Determine the number of unique locations in which the coffee shops are situated.
df['Location'].nunique()

4

# g_DUPLICATED

In [46]:
# How would you identify if there are any duplicate rows in the DataFrame?
# Which coffee shops in the 'Coffee_Shop_Name' column have duplicated entries?
# Can you find any rows where only the 'Rating_out_of_5' and 'Coffee_Shop_Name' columns combined have duplicates?
# How many rows are duplicates based on the 'Location' column?
# Are there any coffee shops in San Diego that have the same name as those in Hollywood?
# ========================================================

# If you wanted to keep only the first instance of each duplicate row based on the 'Coffee_Shop_Name' and 'Location', how would you do it?
# How many entries in the 'Opening_Hours' column are repeated across different coffee shops?
# Can you produce a DataFrame which showcases only the duplicated rows, excluding the first occurrence of each?
# Are there any coffee shops with the same name and rating but different opening hours?
# If you wanted to mark all duplicates (without dropping them) in a new column called 'Is_Duplicated', how would you do it?

In [47]:
# How would you identify if there are any duplicate rows in the DataFrame?
df.duplicated().any()

False

In [48]:
# Which coffee shops in the 'Coffee_Shop_Name' column have duplicated entries?

df['Coffee_Shop_Name'].duplicated().sum()

0

In [49]:
# Can you find any rows where only the 'Rating_out_of_5' and 'Coffee_Shop_Name' columns combined have duplicates?
df[['Rating_out_of_5', 'Coffee_Shop_Name']].duplicated().sum()

0

In [50]:
# How many rows are duplicates based on the 'Location' column?
df['Location'].duplicated().sum()

3

In [51]:
# Are there any coffee shops in San Diego that have the same name as those in Hollywood?
df[df['Location'].isin(["San Diego", "Hollywood"])]['Coffee_Shop_Name'].duplicated().any()

False

In [52]:

# If you wanted to keep only the first instance of each duplicate row based on the 'Coffee_Shop_Name' and 'Location', how would you do it?
# How many entries in the 'Opening_Hours' column are repeated across different coffee shops?
# Can you produce a DataFrame which showcases only the duplicated rows, excluding the first occurrence of each?
# Are there any coffee shops with the same name and rating but different opening hours?
# If you wanted to mark all duplicates (without dropping them) in a new column called 'Is_Duplicated', how would you do it?

# h_DROP

In [53]:
# How would you drop the 'Opening_Hours' column from the DataFrame?
# If you wanted to remove the first three rows from the DataFrame, how would you achieve this?
# Can you produce a version of the DataFrame without the 'Rating_out_of_5' and 'Opening_Hours' columns?
# If you identified specific coffee shop names that you wanted to exclude from the DataFrame, how could you drop rows based on these names?
# How would you create a DataFrame without the last 5 rows?
# ===============================================================

# Imagine you wanted to drop all rows where the 'Rating_out_of_5' is below 3.5. How would you do this?
# If you have a list of index labels that you want to remove from the DataFrame, how would you drop those rows using the drop method?
# How would you drop any columns that have more than 2 NaN values?
# Is it possible to drop a column in-place, meaning without reassigning to the DataFrame or a new variable?
# How can you drop a column based on its data type, for instance, if you want to remove all columns of type 'object'?

In [54]:
# How would you drop the 'Opening_Hours' column from the DataFrame?
df['Opening_Hours'] = ["8am - 6pm", "9am - 9pm", "7am - 7pm", "8am - 8pm", "9am - 5pm", "6am - 6pm", "9am - 10pm"]
df.drop(columns = 'Opening_Hours')

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day  Rating_old
0        HollyBrew  Hollywood              4.5               320         2.0
1       Diego Drip  San Diego              5.0               290         NaN
2      NY Espresso   New York              4.0               505         2.0
3      Holly Beans  Hollywood              4.7               330         NaN
4    Diego Morning  San Diego              4.3               280         NaN
5      NY Caffeine   Brooklyn              4.4               520         NaN
6    Diego Delight  San Diego              4.2               270         3.0

In [55]:
# If you wanted to remove the first three rows from the DataFrame, how would you achieve this?
df.iloc[3:]

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [56]:
# Can you produce a version of the DataFrame without the 'Rating_out_of_5' and 'Opening_Hours' columns?
df.drop(columns = ['Rating_out_of_5', 'Opening_Hours'])

  Coffee_Shop_Name   Location  Visitors_per_day  Rating_old
0        HollyBrew  Hollywood               320         2.0
1       Diego Drip  San Diego               290         NaN
2      NY Espresso   New York               505         2.0
3      Holly Beans  Hollywood               330         NaN
4    Diego Morning  San Diego               280         NaN
5      NY Caffeine   Brooklyn               520         NaN
6    Diego Delight  San Diego               270         3.0

In [57]:
# If you identified specific coffee shop names that you wanted to exclude from the DataFrame, how could you drop rows based on these names?
df.drop(columns = "Coffee_Shop_Name", axis = 0)

    Location  Rating_out_of_5  Visitors_per_day  Rating_old Opening_Hours
0  Hollywood              4.5               320         2.0     8am - 6pm
1  San Diego              5.0               290         NaN     9am - 9pm
2   New York              4.0               505         2.0     7am - 7pm
3  Hollywood              4.7               330         NaN     8am - 8pm
4  San Diego              4.3               280         NaN     9am - 5pm
5   Brooklyn              4.4               520         NaN     6am - 6pm
6  San Diego              4.2               270         3.0    9am - 10pm

In [58]:
df.drop(columns = "Coffee_Shop_Name", axis = 1)

    Location  Rating_out_of_5  Visitors_per_day  Rating_old Opening_Hours
0  Hollywood              4.5               320         2.0     8am - 6pm
1  San Diego              5.0               290         NaN     9am - 9pm
2   New York              4.0               505         2.0     7am - 7pm
3  Hollywood              4.7               330         NaN     8am - 8pm
4  San Diego              4.3               280         NaN     9am - 5pm
5   Brooklyn              4.4               520         NaN     6am - 6pm
6  San Diego              4.2               270         3.0    9am - 10pm

In [59]:
# How would you create a DataFrame without the last 5 rows?
df.drop(df.tail(5).index, inplace=False)

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm

In [60]:
#  Imagine you wanted to drop all rows where the 'Rating_out_of_5' is below 3.5. How would you do this?
# If you have a list of index labels that you want to remove from the DataFrame, how would you drop those rows using the drop method?
# How would you drop any columns that have more than 2 NaN values?
# Is it possible to drop a column in-place, meaning without reassigning to the DataFrame or a new variable?
# How can you drop a column based on its data type, for instance, if you want to remove all columns of type 'object'?

# i_drop_Duplicates

In [61]:
# How would you remove duplicate rows in the DataFrame based solely on the 'Coffee_Shop' column?
# If you want to keep only the first occurrence of each duplicate 'Coffee_Shop' entry and remove subsequent ones, which parameter would you adjust in drop_duplicates?
# How can you drop duplicate rows based on a combination of the 'Coffee_Shop' and 'City' columns?
# After using drop_duplicates, how would you reset the index so that it's continuous again?
# How can you use drop_duplicates to retain the last occurrence of a duplicated row rather than the default behavior which retains the first occurrence?
# =============================================================

# If you wanted to drop duplicates but only for rows where the 'Rating_out_of_5' is above 4, how might you achieve this?
# How would you determine the number of duplicate rows based on the 'City' column in the DataFrame?
# Is it possible to drop duplicates in the original DataFrame without creating a new variable or DataFrame? If so, which parameter would you adjust?
# How can you check if the 'Opening_Hours' column contains any duplicated entries?
# Can you use drop_duplicates in conjunction with another method to count how many unique rows you have based on the 'Coffee_Shop' and 'City' columns?

In [62]:
# How would you remove duplicate rows in the DataFrame based solely on the 'Coffee_Shop' column?
df['Coffee_Shop_Name'].drop_duplicates()

0        HollyBrew
1       Diego Drip
2      NY Espresso
3      Holly Beans
4    Diego Morning
5      NY Caffeine
6    Diego Delight
Name: Coffee_Shop_Name, dtype: object

In [63]:
# If you want to keep only the first occurrence of each duplicate 'Coffee_Shop' entry and remove subsequent ones, which parameter would you adjust in drop_duplicates?
df['Coffee_Shop_Name'].drop_duplicates(keep = 'first')

0        HollyBrew
1       Diego Drip
2      NY Espresso
3      Holly Beans
4    Diego Morning
5      NY Caffeine
6    Diego Delight
Name: Coffee_Shop_Name, dtype: object

In [64]:
# How can you drop duplicate rows based on a combination of the 'Coffee_Shop' and 'City' columns?
df.drop_duplicates(subset=['Coffee_Shop_Name', 'Location'], inplace=False)

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [65]:
# After using drop_duplicates, how would you reset the index so that it's continuous again?
df['Location'].drop_duplicates().reset_index(drop = True)

0    Hollywood
1    San Diego
2     New York
3     Brooklyn
Name: Location, dtype: object

In [66]:
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [67]:
# How can you use drop_duplicates to retain the last occurrence of a duplicated row rather than the default behavior which retains the first occurrence?
df.drop_duplicates(keep = 'last')

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

# j_SORT

In [68]:
# How would you sort the DataFrame based on the 'Rating_out_of_5' column in descending order to see the top-rated coffee shops first?
# Can you sort the DataFrame by the 'Location' column in alphabetical order?
# Imagine you want to sort first by the 'Location' column in alphabetical order and then, within each city, by 'Rating_out_of_5' in descending order. How would you achieve this?
# How can you sort the DataFrame based on its index values?
# If the 'Opening_Hours' column is formatted as 'HH:MM AM/PM', how would you sort the coffee shops based on their opening hours from earliest to latest?
# ===========================================================

# Can you sort the 'Coffee_Shop' column in a case-insensitive manner?
# Is it possible to sort the DataFrame by multiple columns, for example, by 'City' and then by 'Price' within each city? If so, how would you do it?
# After adding a new entry to the DataFrame, the index might be out of order. How would you sort the DataFrame by its index to make it sequential again?
# Suppose you're interested in the middle range of coffee prices. How would you sort the DataFrame by 'Price' and then take a subset of rows from the middle of the sorted DataFrame?
# If the DataFrame is multi-indexed with 'City' as the first level and 'Coffee_Shop' as the second level, how would you sort by the 'City' level?

In [69]:
# How would you sort the DataFrame based on the 'Rating_out_of_5' column 
# in descending order to see the top-rated coffee shops first?

df.sort_values(by = 'Rating_out_of_5', ascending = False)

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm

In [70]:
# Can you sort the DataFrame by the 'City' column in alphabetical order?

df.sort_values(by = 'Location')

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [71]:
# Imagine you want to sort first by the 'Location' column in 
# alphabetical order and then, within each city, by 'Rating_out_of_5' in descending order. How would you achieve this?

df.sort_values(by = ['Visitors_per_day',"Rating_out_of_5"], ascending = [False, True])

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [72]:
# How can you sort the DataFrame based on its index values?
df.sort_index()

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [73]:
# If the 'Opening_Hours' column is formatted as 'HH:MM AM/PM', how would you sort the coffee shops based on their opening hours from earliest to latest?
df.sort_values(by = 'Opening_Hours')

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm

# K_isIn

In [74]:
# How would you filter the DataFrame to only show coffee shops located in 'Hollywood' or 'San Diego'?
# Imagine you have a list of top-rated coffee shop names: ["Brew Magic", "Café Dreams", "Bean Palace"]. How would you filter the DataFrame to only display these coffee shops?
# Can you identify rows where the 'Rating_out_of_5' is either 4.5 or 5?
# If you want to analyze coffee shops that are open either at "06:00 AM" or "07:00 AM", how would you filter the DataFrame based on the 'Opening_Hours' column?
# Suppose you're given a list of coffee shop IDs that are part of a promotional campaign. How would you use isin to filter the DataFrame to only those IDs?
# =======================================================

# If you're interested in studying the price range of coffee in certain shops, how would you filter the DataFrame for shops where the 'Price' is either $3, $4, or $5?
# How can you use isin in combination with the ~ operator to filter out rows where the city is either 'Hollywood' or 'San Diego'?
# If you have another DataFrame containing popular coffee flavors, and you want to see if any of the coffee shop names in your DataFrame match these flavors, how would you use isin to achieve this?
# Imagine you want to exclude certain ratings for a study. How would you use isin to filter out coffee shops with ratings of 1 or 2 out of 5?
# Suppose you're working on a marketing campaign and have a list of cities you're targeting. How would you use isin to get a subset of the DataFrame for coffee shops in those cities?

In [75]:
# How would you filter the DataFrame to only show coffee shops located in 'Hollywood' or 'San Diego'?
df[df['Coffee_Shop_Name'].isin(['Hollywood', 'San Diego'])]

Empty DataFrame
Columns: [Coffee_Shop_Name, Location, Rating_out_of_5, Visitors_per_day, Rating_old, Opening_Hours]
Index: []

In [76]:
# Imagine you have a list of top-rated coffee shop names: ["Brew Magic", "Café Dreams", "Bean Palace"]. How would you filter the DataFrame to only display these coffee shops?
coffee_shop_names = ['NY Espresso']
df[df['Coffee_Shop_Name'].isin(coffee_shop_names)]

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm

In [77]:
# Can you identify rows where the 'Rating_out_of_5' is either 4.5 or 5?
df[df['Rating_out_of_5'].isin([4.5, 5])]

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm

In [78]:
# If you want to analyze coffee shops that are open either at 
# "06:00 AM" or "07:00 AM", 
# how would you filter the DataFrame based on the 'Opening_Hours' column?

df[df['Opening_Hours'].isin(['6', '7'])]

Empty DataFrame
Columns: [Coffee_Shop_Name, Location, Rating_out_of_5, Visitors_per_day, Rating_old, Opening_Hours]
Index: []

In [79]:
# Suppose you're given a list of coffee shop IDs 
# that are part of a promotional campaign. 
# How would you use isin to filter the DataFrame to only those IDs?
coffee_shop_names = ['NY Espresso']
df[df['Coffee_Shop_Name'].isin(coffee_shop_names)]

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm

# L_asType

In [80]:
# If you wanted to analyze the 'Location' column as a category for memory efficiency and faster operations, how would you change its data type?
# How would you convert the 'Rating_out_of_5' column to a string data type?
# If you needed to analyze the 'Visitors_per_day' column as a floating point number for calculations, how would you change its data type?
# For memory efficiency, how would you convert the 'Location' column to a categorical type?
# To ensure consistent data processing, how can you convert all columns of the DataFrame to string data types?
# If you had a 'Date' column in the format 'YYYY-MM-DD' and wanted to keep it as a string for text processing tasks rather than a datetime object, how would you ensure it's a string?
# For a more generalized rating system, how would you convert the 'Rating_out_of_5' column to an integer type, effectively rounding off the values?
# If the 'Coffee_Shop_Name' column had numeric entries (e.g., franchise numbers) and you wanted to ensure they're treated as integers, how would you change its data type?
# In a scenario where the 'Visitors_per_day' column has been mistakenly recorded as a float and you want to revert it back to an integer format, how would you achieve this?
# Assuming you have a boolean column indicating whether a coffee shop offers Wi-Fi (True/False). If you wanted to represent this data as integers (1 for True, 0 for False), how would you convert the boolean column?

In [81]:
# If you wanted to analyze the 'Location' column as a category for memory efficiency and faster operations, how would you change its data type?
df['Location'].astype('category')

0    Hollywood
1    San Diego
2     New York
3    Hollywood
4    San Diego
5     Brooklyn
6    San Diego
Name: Location, dtype: category
Categories (4, object): ['Brooklyn', 'Hollywood', 'New York', 'San Diego']

In [82]:
# How would you convert the 'Rating_out_of_5' column to a string data type?
df['Rating_out_of_5'].astype(str)

0    4.5
1    5.0
2    4.0
3    4.7
4    4.3
5    4.4
6    4.2
Name: Rating_out_of_5, dtype: object

In [83]:
# If you needed to analyze the 'Visitors_per_day' column as a floating point number for calculations, how would you change its data type?
df['Visitors_per_day'].astype(float)

0    320.0
1    290.0
2    505.0
3    330.0
4    280.0
5    520.0
6    270.0
Name: Visitors_per_day, dtype: float64

In [84]:
# For memory efficiency, how would you convert the 'Location' column to a categorical type?
df['Location'].astype("category")

0    Hollywood
1    San Diego
2     New York
3    Hollywood
4    San Diego
5     Brooklyn
6    San Diego
Name: Location, dtype: category
Categories (4, object): ['Brooklyn', 'Hollywood', 'New York', 'San Diego']

In [85]:
# To ensure consistent data processing, how can you convert all columns of the DataFrame to string data types?
df.astype("category")

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [86]:
df = df.astype("category")

In [87]:
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [88]:
df.dtypes

Coffee_Shop_Name    category
Location            category
Rating_out_of_5     category
Visitors_per_day    category
Rating_old          category
Opening_Hours       category
dtype: object

In [89]:
# If you had a 'Date' column in the format 'YYYY-MM-DD' and wanted to keep it as a string for text processing tasks rather than a datetime object, how would you ensure it's a string?
# For a more generalized rating system, how would you convert the 'Rating_out_of_5' column to an integer type, effectively rounding off the values?
# If the 'Coffee_Shop_Name' column had numeric entries (e.g., franchise numbers) and you wanted to ensure they're treated as integers, how would you change its data type?
# In a scenario where the 'Visitors_per_day' column has been mistakenly recorded as a float and you want to revert it back to an integer format, how would you achieve this?
# Assuming you have a boolean column indicating whether a coffee shop offers Wi-Fi (True/False). If you wanted to represent this data as integers (1 for True, 0 for False), how would you convert the boolean column?

# M_replace

In [90]:
# If you wanted to rename all instances of 'Hollywood' to 'LA' in the 'Location' column, how would you achieve that?
# Imagine the 'Rating_out_of_5' column mistakenly recorded a rating of 5.5 for a few shops. How would you correct this and replace it with 5.0?
# In the 'Coffee_Shop_Name' column, suppose the brand 'Diego' has been rebranded to 'SD'. How would you reflect this change in the DataFrame?
# Suppose you want to replace ratings that are below 4.0 in 'Rating_out_of_5' with a 'Below Average' label. How can you achieve this?
# How would you replace multiple locations, say 'Hollywood' and 'San Diego', with 'California' in the 'Location' column at once?
# ==============================================================
# Imagine there's a consistent typo across your DataFrame where 'Espresso' is mistakenly written as 'Expresso'. How would you correct this typo in the 'Coffee_Shop_Name' column?
# How can you replace all the NaN (missing) values in the 'Visitors_per_day' column with the average number of visitors?
# Let's say for some coffee shops, the 'Rating_out_of_5' is recorded as 0 due to an error, and you want to replace this with the median rating. How would you do it?
# Assuming there's a column 'Has_Wifi' with values 'Yes' and 'No'. If you wanted to make it more machine-readable by converting 'Yes' to 1 and 'No' to 0, how would you approach this?
# How can you use regular expressions with the replace() method to change any instance of 'NY' at the beginning of the coffee shop name to 'New York' in the 'Coffee_Shop_Name' column?

In [91]:
# If you wanted to rename all instances of 'Hollywood' to 'LA' in the 'Location' column, how would you achieve that?
df['Location'].replace('Hollywood', 'LA', inplace = False)

0           LA
1    San Diego
2     New York
3           LA
4    San Diego
5     Brooklyn
6    San Diego
Name: Location, dtype: category
Categories (4, object): ['Brooklyn', 'LA', 'New York', 'San Diego']

In [92]:
# Imagine the 'Rating_out_of_5' column mistakenly recorded a rating of 5.5 for a few shops. How would you correct this and replace it with 5.0?

df['Rating_out_of_5'].replace(5.5, 5)

C:\ProgramData\Anaconda3\lib\site-packages\IPython\lib\pretty.py:778: FutureWarning: Index.ravel returning ndarray is deprecated; in a future version this will return a view on self.
  output = repr(obj)

0    4.5
1    5.0
2    4.0
3    4.7
4    4.3
5    4.4
6    4.2
Name: Rating_out_of_5, dtype: category
Categories (7, float64): [4.0, 4.2, 4.3, 4.4, 4.5, 4.7, 5.0]

In [93]:
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [94]:
# In the 'Coffee_Shop_Name' column, suppose the brand 'Diego' has been rebranded to 'SD'. How would you reflect this change in the DataFrame?
df['Coffee_Shop_Name'].replace('Diego Drip', 'DG')

0        HollyBrew
1               DG
2      NY Espresso
3      Holly Beans
4    Diego Morning
5      NY Caffeine
6    Diego Delight
Name: Coffee_Shop_Name, dtype: category
Categories (7, object): ['Diego Delight', 'DG', 'Diego Morning', 'Holly Beans', 'HollyBrew', 'NY Caffeine', 'NY Espresso']

In [98]:
# # Suppose you want to replace ratings that are below 4.0 in 'Rating_out_of_5' with a 'Below Average' label. How can you achieve this?
# df.loc[df['Rating_out_of_5'] < 0.2, 'Rating_out_of_5'] = 'Below Average'
# df

In [99]:
# How would you replace multiple locations, say 'Hollywood' and 'San Diego', with 'California' in the 'Location' column at once?
df['Location'].replace(['Hollywood', 'San Diego'], 'Ca')

0          Ca
1          Ca
2    New York
3          Ca
4          Ca
5    Brooklyn
6          Ca
Name: Location, dtype: category
Categories (3, object): ['Brooklyn', 'Ca', 'New York']

In [100]:
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

# N_rename

In [101]:
# How would you rename the column 'Coffee_Shop_Name' to 'Shop_Name'?

# Imagine the management decided to call 'Visitors_per_day' as 'Daily_Footfall'. How would you reflect this change in the DataFrame?

# If you wanted to change the 'Location' column to 'City', how would you achieve this?

# Suppose the ratings scale has changed, and instead of 'Rating_out_of_5', it should be 'Rating_out_of_10'. How would you rename the column?

# If you wanted to rename only the index of the row with 'NY Espresso' to 'NYE', how would you do that?

# Can you rename both 'Coffee_Shop_Name' and 'Location' columns to 'Cafe_Name' and 'Area' respectively in a single operation?

# Imagine a scenario where all column names need to be uppercase. How would you use the rename() method with a function to achieve this?

# If you added more columns and wanted to rename only the first two columns to 'Cafe' and 'Region' without referring to their original names, how would you do it?

# Suppose you need to append "_Data" to each column name for clarity. How would you rename all the columns to achieve this?

# Given a dictionary of old and new names, how would you apply it to the DataFrame to rename multiple columns at once?

In [102]:
# How would you rename the column 'Coffee_Shop_Name' to 'Shop_Name'?
df.rename(columns = {'Coffee_Shop_Name':'Shop_Name'})

,Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [103]:
# Imagine the management decided to call 'Visitors_per_day' as 'Daily_Footfall'. How would you reflect this change in the DataFrame?

df.rename(columns = {"Visitors_per_day": "Daily_Footfall"})

,Coffee_Shop_Name,Location,Rating_out_of_5,Daily_Footfall,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [104]:

# If you wanted to change the 'Location' column to 'City', how would you achieve this?
df.rename(columns = {'Location': 'City'})

,Coffee_Shop_Name,City,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [105]:

# Suppose the ratings scale has changed, and instead of 'Rating_out_of_5', it should be 'Rating_out_of_10'. How would you rename the column?
df.rename(columns = {"Rating_out_of_5": "Rating_out_of_10"})

,Coffee_Shop_Name,Location,Rating_out_of_10,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [106]:
# If you wanted to rename only the index of the row with 'NY Espresso' to 'NYE', how would you do that?
df.rename(columns = {'NY Espresso': 'NYE'})

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
1,Diego Drip,San Diego,5.0,290,NaN,9am - 9pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
3,Holly Beans,Hollywood,4.7,330,NaN,8am - 8pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

# O_Between

In [107]:
# How would you select rows where the 'Rating_out_of_5' is between 4.0 and 4.5 (inclusive)?

# Can you filter the DataFrame to only include coffee shops with 'Visitors_per_day' between 300 and 400?

# How would you retrieve coffee shops in 'Location' 'San Diego' that have ratings between 4.1 and 4.4?

# Find rows where 'Visitors_per_day' is not between 280 and 520.

# Can you fetch the 'Coffee_Shop_Name' of the shops with ratings between 4.2 and 4.8?

# How would you use the between() method to get coffee shops that are among the top 3 in terms of 'Visitors_per_day'?

# Is it possible to use the between() method to filter out coffee shops in 'Location' either 'Hollywood' or 'New York' with a 'Rating_out_of_5' between 4.0 and 4.5? If so, how?

# Retrieve coffee shops with 'Visitors_per_day' between 290 and 500 but exclude those with a 'Rating_out_of_5' of 4.1.

# Using the between() method, how would you get a boolean series indicating which rows have 'Visitors_per_day' between 320 and 500?

# If you had a date column in the DataFrame, how would you use the between() method to filter coffee shops that have records between two specific dates?

In [108]:
# How would you select rows where the 'Rating_out_of_5' is between 4.0 and 4.5 (inclusive)?
df['Rating_out_of_5'] = df['Rating_out_of_5'].astype(float)
df[df['Rating_out_of_5'].between(4.0, 4.5)]

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Rating_old,Opening_Hours
0,HollyBrew,Hollywood,4.5,320,2.0,8am - 6pm
2,NY Espresso,New York,4.0,505,2.0,7am - 7pm
4,Diego Morning,San Diego,4.3,280,NaN,9am - 5pm
5,NY Caffeine,Brooklyn,4.4,520,NaN,6am - 6pm
6,Diego Delight,San Diego,4.2,270,3.0,9am - 10pm

In [136]:
# Can you filter the DataFrame to only include coffee shops with 'Visitors_per_day' between 300 and 400?
data = {
'Coffee_Shop_Name': ['HollyBrew', 'Diego Drip', 'NY Espresso', 'Holly Beans', 'Diego Morning', 'NY Caffeine', 'Diego Delight'],
'Location': ['Hollywood', 'San Diego', 'New York', 'Hollywood', 'San Diego', 'New York', 'San Diego'],
'Rating_out_of_5': [4.5, 4.1, 4.0, 4.7, 4.3, 4.4, 4.2],
'Visitors_per_day': [320, 290, 500, 330, 280, 520, 270]
}

df = pd.DataFrame(data)

df[df['Visitors_per_day'].between(300, 400)]

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
3      Holly Beans  Hollywood              4.7               330

In [137]:
# How would you retrieve coffee shops in 'Location' 'San Diego' that have ratings between 4.1 and 4.4?

df[(df['Location'] == 'San Diego')& (df['Rating_out_of_5'].between(4.1, 4.4))]

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
1       Diego Drip  San Diego              4.1               290
4    Diego Morning  San Diego              4.3               280
6    Diego Delight  San Diego              4.2               270

In [138]:

# Find rows where 'Visitors_per_day' is not between 280 and 520.

df[df['Visitors_per_day'].between(280, 520)]

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              4.1               290
2      NY Espresso   New York              4.0               500
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              4.3               280
5      NY Caffeine   New York              4.4               520

In [139]:
# Can you fetch the 'Coffee_Shop_Name' of the shops with ratings between 4.2 and 4.8?

df.loc[df['Rating_out_of_5'].between(4.2, 4.5),'Coffee_Shop_Name'].to_frame()

  Coffee_Shop_Name
0        HollyBrew
4    Diego Morning
5      NY Caffeine
6    Diego Delight

# P_clip

In [140]:
# How would you ensure that all ratings in 'Rating_out_of_5' are at least 4.0?
# Can you clip the 'Visitors_per_day' column such that no coffee shop has more than 500 visitors?
# How would you set both lower and upper bounds on 'Rating_out_of_5' such that ratings are between 4.0 and 4.5?
# If for some reason the 'Rating_out_of_5' column had values higher than 5, how would you clip those values to a maximum of 5?
# How would you clip the 'Visitors_per_day' column such that no coffee shop has less than 300 or more than 450 visitors?

# If a data entry error resulted in some shops having negative values in 'Visitors_per_day', how would you correct this by ensuring all values are non-negative using clip?
# Can you clip the 'Rating_out_of_5' column so that all values below the mean rating are set to the mean rating value?
# How would you ensure tat all values in the 'Visitors_per_day' column are at least 100 more than the minimum value in that column?
# Suppose you have an external series of lower bounds and another one of upper bounds, how would you use them to clip the values in 'Rating_out_of_5'?
# How would you use the clip() function to make sure none of the coffee shops in 'Location' 'San Diego' have more than 400 'Visitors_per_day'?

In [141]:
# How would you ensure that all ratings in 'Rating_out_of_5' are at least 4.0?
df['Rating_out_of_5'].clip(lower = 4.0)

0    4.5
1    4.1
2    4.0
3    4.7
4    4.3
5    4.4
6    4.2
Name: Rating_out_of_5, dtype: float64

In [142]:
# Can you clip the 'Visitors_per_day' column such that no coffee shop has more than 500 visitors?
df['Visitors_per_day'].clip(lower = 500)

0    500
1    500
2    500
3    500
4    500
5    520
6    500
Name: Visitors_per_day, dtype: int64

In [143]:
# How would you set both lower and upper bounds on 'Rating_out_of_5' such that ratings are between 4.0 and 4.5?
df['Rating_out_of_5'].clip(lower = 4.0, upper = 4.5)

0    4.5
1    4.1
2    4.0
3    4.5
4    4.3
5    4.4
6    4.2
Name: Rating_out_of_5, dtype: float64

In [144]:
# If for some reason the 'Rating_out_of_5' column had values higher than 5, how would you clip those values to a maximum of 5?
df['Rating_out_of_5'].clip(upper = 5.0)

0    4.5
1    4.1
2    4.0
3    4.7
4    4.3
5    4.4
6    4.2
Name: Rating_out_of_5, dtype: float64

In [145]:
# How would you clip the 'Visitors_per_day' column such that no coffee shop has less than 300 or more than 450 visitors?
df['Visitors_per_day'].clip(lower = 300, upper = 450)

0    320
1    300
2    450
3    330
4    300
5    450
6    300
Name: Visitors_per_day, dtype: int64

# Q_Explode

In [146]:
# Assuming the 'Location' column had a list of locations for each coffee shop, how would you transform each item in the list into separate rows?
# If 'Rating_out_of_5' was actually a list of ratings received throughout the week, how would you explode this column to visualize individual ratings?
# Imagine 'Visitors_per_day' was an array of visitors for each day of the week. How would you explode this column to get a row-wise breakdown for each day?
# Suppose 'Coffee_Shop_Name' contained aliases or other names for the coffee shop in a list. How would you expand this list into separate rows while keeping the other column values consistent?
# If you exploded the 'Location' column, which transformed lists into individual rows, how would you then reset the index of the DataFrame to maintain a sequential order?

# After exploding the 'Rating_out_of_5' column, how would you group by 'Coffee_Shop_Name' and calculate the average rating for each shop?
# Imagine the 'Visitors_per_day' column contained a list of visitors for both weekdays and weekends. After exploding this column, how would you filter only the rows corresponding to weekend visitors?
# If the 'Coffee_Shop_Name' column had subsidiary coffee shop names in a list and you wanted to create a separate DataFrame with only these subsidiary names (after exploding), how would you do it?
# Suppose you've exploded the 'Location' column, and now you have multiple rows for each coffee shop. How would you count the number of unique locations each coffee shop is present in?
# After exploding a column, you might end up with duplicate rows. How would you remove these duplicates to retain only unique rows in the DataFrame?

In [147]:
import pandas as pd

data = {
    'Coffee_Shop_Name': ['HollyBrew', 'Diego Drip', 'NY Espresso', 'Holly Beans', 'Diego Morning', 'NY Caffeine', 'Diego Delight'],
    'Location': [['Hollywood', 'Beverly Hills'], ['San Diego', 'La Jolla'], ['New York', 'Brooklyn'], ['Hollywood', 'Downtown LA'], ['San Diego', 'Oceanside'], ['New York', 'Manhattan'], ['San Diego', 'Chula Vista']],
    'Rating_out_of_5': [4.5, 4.1, 4.0, 4.7, 4.3, 4.4, 4.2],
    'Visitors_per_day': [320, 290, 500, 330, 280, 520, 270]
}

df = pd.DataFrame(data)
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day
0,HollyBrew,"[Hollywood, Beverly Hills]",4.5,320
1,Diego Drip,"[San Diego, La Jolla]",4.1,290
2,NY Espresso,"[New York, Brooklyn]",4.0,500
3,Holly Beans,"[Hollywood, Downtown LA]",4.7,330
4,Diego Morning,"[San Diego, Oceanside]",4.3,280
5,NY Caffeine,"[New York, Manhattan]",4.4,520
6,Diego Delight,"[San Diego, Chula Vista]",4.2,270

In [148]:
# Assuming the 'Location' column had a list of locations for each coffee shop, how would you transform each item in the list into separate rows?
df_exploded = df.explode('Location').reset_index(drop = 1)
df_exploded

   Coffee_Shop_Name       Location  Rating_out_of_5  Visitors_per_day
0         HollyBrew      Hollywood              4.5               320
1         HollyBrew  Beverly Hills              4.5               320
2        Diego Drip      San Diego              4.1               290
3        Diego Drip       La Jolla              4.1               290
4       NY Espresso       New York              4.0               500
5       NY Espresso       Brooklyn              4.0               500
6       Holly Beans      Hollywood              4.7               330
7       Holly Beans    Downtown LA              4.7               330
8     Diego Morning      San Diego              4.3               280
9     Diego Morning      Oceanside              4.3               280
10      NY Caffeine       New York              4.4               520
11      NY Caffeine      Manhattan              4.4               520
12    Diego Delight      San Diego              4.2               270
13    Diego Delight    Chula Vista              4.2               270

In [149]:
# If 'Rating_out_of_5' was actually a list of ratings received throughout the week, how would you explode this column to visualize individual ratings?
df_exploded = df.explode('Rating_out_of_5')

In [150]:
# Imagine 'Visitors_per_day' was an array of visitors for each day of the week. How would you explode this column to get a row-wise breakdown for each day?
df_exploded = df.explode('Visitors_per_day')

In [151]:
# Suppose 'Coffee_Shop_Name' contained aliases or other names for the coffee shop in a list. How would you expand this list into separate rows while keeping the other column values consistent?
df_exploded = df.explode('Coffee_Shop_Name')

In [152]:
# If you exploded the 'Location' column, which transformed lists into individual rows, how would you then reset the index of the DataFrame to maintain a sequential order?
df_exploded = df.explode('Location')

In [153]:
df_Location_exploded = df["Location"].explode('Location')

# R_Flatten

In [154]:
import pandas as pd

data = {
'Name': ['John', 'Alice', 'Bob'],
'Scores': [{'Math': 85, 'History': 92}, {'Math': 88, 'History': 78}, {'Math': 76, 'History': 82}],
'Contacts': [['1234567890', 'j@email.com'], ['9876543210', 'a@email.com'], ['1234987650', 'b@email.com']]
}

df = pd.DataFrame(data)
df

    Name                       Scores                   Contacts
0   John  {'Math': 85, 'History': 92}  [1234567890, j@email.com]
1  Alice  {'Math': 88, 'History': 78}  [9876543210, a@email.com]
2    Bob  {'Math': 76, 'History': 82}  [1234987650, b@email.com]

In [155]:
# How would you flatten the Scores column to have separate columns for each subject, like Scores_Math and Scores_History?
# How can you split the Contacts column into two separate columns: Phone and Email?
# If you wanted to create a completely flat DataFrame without nested lists or dictionaries, how would you achieve that?
# Suppose you wanted to create a multi-index DataFrame using the Name column as the first level and the subjects from the Scores column as the second level, how would you go about it?

In [156]:
# Using basic Python
nested_list = [[1, 2, 3], [4, 5, 6], [7, 8, 9]]
flattened_list = [item for sublist in nested_list for item in sublist]
flattened_list

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [157]:
#using numpy
import numpy as np
nested_array = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
flattened_array = nested_array.flatten()
flattened_array

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [158]:
scores_df = df['Scores'].apply(pd.Series)
scores_df

   Math  History
0    85       92
1    88       78
2    76       82

In [159]:
scores_df = scores_df.rename(columns={'Math': 'Scores_Math', 'History': 'Scores_History'})

In [160]:
df

    Name                       Scores                   Contacts
0   John  {'Math': 85, 'History': 92}  [1234567890, j@email.com]
1  Alice  {'Math': 88, 'History': 78}  [9876543210, a@email.com]
2    Bob  {'Math': 76, 'History': 82}  [1234987650, b@email.com]

In [161]:
df = pd.concat([df.drop('Scores', axis=1), scores_df], axis= 0)

In [162]:
df

    Name                   Contacts  Scores_Math  Scores_History
0   John  [1234567890, j@email.com]          NaN             NaN
1  Alice  [9876543210, a@email.com]          NaN             NaN
2    Bob  [1234987650, b@email.com]          NaN             NaN
0    NaN                        NaN         85.0            92.0
1    NaN                        NaN         88.0            78.0
2    NaN                        NaN         76.0            82.0

# s_MELT

In [ ]:


import pandas as pd

data = {
    'Coffee_Shop_Name': ['HollyBrew', 'Diego Drip', 'NY Espresso', 'Holly Beans', 'Diego Morning', 'NY Caffeine', 'Diego Delight'],
    'Location': ['Hollywood', 'San Diego', 'New York', 'Hollywood', 'San Diego', 'New York', 'San Diego'],
    'Rating_out_of_5': [4.5, 4.1, 4.0, 4.7, 4.3, 4.4, 4.2],
    'Visitors_per_day': [320, 290, 500, 330, 280, 520, 270]
}

df = pd.DataFrame(data)
df

In [164]:
# How would you reshape the DataFrame such that you have a long-format structure, keeping Coffee_Shop_Name as the identifier, and having Location, Rating_out_of_5, and Visitors_per_day as value columns? What would the resulting DataFrame look like?

# Imagine you want to analyze only the ratings of the coffee shops without considering the visitors. How would you use the melt() function to keep Coffee_Shop_Name and Location as identifiers and only have ratings as values?

# If you'd like to structure the DataFrame so that for every coffee shop, you have separate rows indicating its Rating_out_of_5 and Visitors_per_day, how would you use melt()?

# Upon melting the DataFrame to analyze the Visitors_per_day attribute, how would you rename the columns resulting from the melt operation to Shop_Name, Shop_Location, Metric, and Data_Value?

In [169]:
# How would you reshape the DataFrame such that you have a long-format structure, 
# keeping Coffee_Shop_Name as the identifier, and having Location, 
# Rating_out_of_5, and Visitors_per_day as value columns? What would the resulting DataFrame look like?

df_melted = df.melt(id_vars='Coffee_Shop_Name', 
                    value_vars=['Location', 'Rating_out_of_5', 'Visitors_per_day'])

df_melted

   Coffee_Shop_Name          variable      value
0         HollyBrew          Location  Hollywood
1        Diego Drip          Location  San Diego
2       NY Espresso          Location   New York
3       Holly Beans          Location  Hollywood
4     Diego Morning          Location  San Diego
5       NY Caffeine          Location   New York
6     Diego Delight          Location  San Diego
7         HollyBrew   Rating_out_of_5        4.5
8        Diego Drip   Rating_out_of_5        4.1
9       NY Espresso   Rating_out_of_5        4.0
10      Holly Beans   Rating_out_of_5        4.7
11    Diego Morning   Rating_out_of_5        4.3
12      NY Caffeine   Rating_out_of_5        4.4
13    Diego Delight   Rating_out_of_5        4.2
14        HollyBrew  Visitors_per_day        320
15       Diego Drip  Visitors_per_day        290
16      NY Espresso  Visitors_per_day        500
17      Holly Beans  Visitors_per_day        330
18    Diego Morning  Visitors_per_day        280
19      NY Caffeine  Visitors_per_day        520
20    Diego Delight  Visitors_per_day        270

In [171]:
# Imagine you want to analyze only the ratings of the coffee shops 
# without considering the visitors. How would you use the melt() function 
# to keep Coffee_Shop_Name and Location as identifiers and only have ratings as values?

df_melted = df.melt(id_vars = ["Coffee_Shop_Name","Location"], value_vars = "Rating_out_of_5")
df_melted

  Coffee_Shop_Name   Location         variable  value
0        HollyBrew  Hollywood  Rating_out_of_5    4.5
1       Diego Drip  San Diego  Rating_out_of_5    4.1
2      NY Espresso   New York  Rating_out_of_5    4.0
3      Holly Beans  Hollywood  Rating_out_of_5    4.7
4    Diego Morning  San Diego  Rating_out_of_5    4.3
5      NY Caffeine   New York  Rating_out_of_5    4.4
6    Diego Delight  San Diego  Rating_out_of_5    4.2

In [173]:
# If you'd like to structure the DataFrame so that for every coffee shop, 
# you have separate rows indicating its 
# Rating_out_of_5 and Visitors_per_day, how would you use melt()?
df_melted = df.melt(id_vars='Coffee_Shop_Name', 
                    value_vars=["Rating_out_of_5", 'Visitors_per_day'])

df_melted

   Coffee_Shop_Name          variable  value
0         HollyBrew   Rating_out_of_5    4.5
1        Diego Drip   Rating_out_of_5    4.1
2       NY Espresso   Rating_out_of_5    4.0
3       Holly Beans   Rating_out_of_5    4.7
4     Diego Morning   Rating_out_of_5    4.3
5       NY Caffeine   Rating_out_of_5    4.4
6     Diego Delight   Rating_out_of_5    4.2
7         HollyBrew  Visitors_per_day  320.0
8        Diego Drip  Visitors_per_day  290.0
9       NY Espresso  Visitors_per_day  500.0
10      Holly Beans  Visitors_per_day  330.0
11    Diego Morning  Visitors_per_day  280.0
12      NY Caffeine  Visitors_per_day  520.0
13    Diego Delight  Visitors_per_day  270.0

In [177]:
# Upon melting the DataFrame to analyze 
# the Visitors_per_day attribute, 
# how would you rename the columns resulting 
# from the melt operation to Shop_Name, 
# Shop_Location, Metric, and Data_Value?

df_melted = df.melt(id_vars='Visitors_per_day').rename(columns = {"Location": "Place"})

df_melted

    Visitors_per_day          variable          value
0                320  Coffee_Shop_Name      HollyBrew
1                290  Coffee_Shop_Name     Diego Drip
2                500  Coffee_Shop_Name    NY Espresso
3                330  Coffee_Shop_Name    Holly Beans
4                280  Coffee_Shop_Name  Diego Morning
5                520  Coffee_Shop_Name    NY Caffeine
6                270  Coffee_Shop_Name  Diego Delight
7                320          Location      Hollywood
8                290          Location      San Diego
9                500          Location       New York
10               330          Location      Hollywood
11               280          Location      San Diego
12               520          Location       New York
13               270          Location      San Diego
14               320   Rating_out_of_5            4.5
15               290   Rating_out_of_5            4.1
16               500   Rating_out_of_5            4.0
17               330   Rating_out_of_5            4.7
18               280   Rating_out_of_5            4.3
19               520   Rating_out_of_5            4.4
20               270   Rating_out_of_5            4.2

In [180]:
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Cumulative_Visitors
0,HollyBrew,Hollywood,4.5,320,320.0
1,Diego Drip,San Diego,4.1,290,610.0
2,NY Espresso,New York,4.0,500,1110.0
3,Holly Beans,Hollywood,4.7,330,1440.0
4,Diego Morning,San Diego,4.3,280,1720.0
5,NY Caffeine,New York,4.4,520,2240.0
6,Diego Delight,San Diego,4.2,270,2510.0

In [182]:
df['Rating_out_of_5_CUM'] = df['Rating_out_of_5'].expanding().sum()
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Cumulative_Visitors,Rating_out_of_5_CUM
0,HollyBrew,Hollywood,4.5,320,320.0,4.5
1,Diego Drip,San Diego,4.1,290,610.0,8.6
2,NY Espresso,New York,4.0,500,1110.0,12.6
3,Holly Beans,Hollywood,4.7,330,1440.0,17.3
4,Diego Morning,San Diego,4.3,280,1720.0,21.6
5,NY Caffeine,New York,4.4,520,2240.0,26.0
6,Diego Delight,San Diego,4.2,270,2510.0,30.2

In [184]:
df['Rating_out_of_5_CUM'] = df['Rating_out_of_5'].expanding().mean()
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Cumulative_Visitors,Rating_out_of_5_CUM
0,HollyBrew,Hollywood,4.5,320,320.0,4.500000
1,Diego Drip,San Diego,4.1,290,610.0,4.300000
2,NY Espresso,New York,4.0,500,1110.0,4.200000
3,Holly Beans,Hollywood,4.7,330,1440.0,4.325000
4,Diego Morning,San Diego,4.3,280,1720.0,4.320000
5,NY Caffeine,New York,4.4,520,2240.0,4.333333
6,Diego Delight,San Diego,4.2,270,2510.0,4.314286

In [186]:
df['Rating_out_of_5_CUM'] = df['Rating_out_of_5'].expanding().median()
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Cumulative_Visitors,Rating_out_of_5_CUM
0,HollyBrew,Hollywood,4.5,320,320.0,4.50
1,Diego Drip,San Diego,4.1,290,610.0,4.30
2,NY Espresso,New York,4.0,500,1110.0,4.10
3,Holly Beans,Hollywood,4.7,330,1440.0,4.30
4,Diego Morning,San Diego,4.3,280,1720.0,4.30
5,NY Caffeine,New York,4.4,520,2240.0,4.35
6,Diego Delight,San Diego,4.2,270,2510.0,4.30

# T_expanding

In [190]:
# How would you compute the cumulative sum of Visitors_per_day using the expanding() 
# function to see the total visitors over time?

# Using the expanding() function, how would you determine the cumulative average rating 
# (from the Rating_out_of_5 column) as you move through each coffee shop?

# If you wanted to keep track of the highest daily visitor count up to 
# the current day, how would you use the expanding() function 
# combined with the max() function on the Visitors_per_day column?

# Imagine you're interested in seeing how the lowest rating progresses 
# as you go through the list of coffee shops. 
# How would you apply the expanding() function on the 
# Rating_out_of_5 column to track the cumulative minimum rating?

In [189]:
# How would you compute the cumulative sum of Visitors_per_day using the expanding() 
# function to see the total visitors over time?

df['Cumulative_Visitors'] = df['Visitors_per_day'].expanding().sum()
df

,Coffee_Shop_Name,Location,Rating_out_of_5,Visitors_per_day,Cumulative_Visitors,Rating_out_of_5_CUM
0,HollyBrew,Hollywood,4.5,320,320.0,4.50
1,Diego Drip,San Diego,4.1,290,610.0,4.30
2,NY Espresso,New York,4.0,500,1110.0,4.10
3,Holly Beans,Hollywood,4.7,330,1440.0,4.30
4,Diego Morning,San Diego,4.3,280,1720.0,4.30
5,NY Caffeine,New York,4.4,520,2240.0,4.35
6,Diego Delight,San Diego,4.2,270,2510.0,4.30

# U_interpolate

In [198]:
data = {
    'Coffee_Shop_Name': ['HollyBrew', 'Diego Drip', 'NY Espresso', 'Holly Beans', 'Diego Morning', 'NY Caffeine', 'Diego Delight'],
    'Location': ['Hollywood', 'San Diego', 'New York', 'Hollywood', 'San Diego', 'New York', 'San Diego'],
    'Rating_out_of_5': [4.5, 4.1, 4.0, 4.7, 4.3, 4.4, 4.2],
    'Visitors_per_day': [320, 290, 500, 330, 280, 520, 270]
}

df = pd.DataFrame(data)
df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              4.1               290
2      NY Espresso   New York              4.0               500
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              4.3               280
5      NY Caffeine   New York              4.4               520
6    Diego Delight  San Diego              4.2               270

In [191]:
# Assume there are some missing values in the Rating_out_of_5 column. 
# How would you use the interpolate() function to fill 
# these NaN values using a linear approach?

# If you had missing values in the Visitors_per_day 
# column and wanted to use a quadratic method to 
# estimate the missing visitor counts, 
# how would you employ the interpolate() function?

# Imagine that the data in Rating_out_of_5 
# has missing values and the data is time-series 
# in nature (even though we don't have 
# explicit timestamps). 
# How would you utilize the interpolate() 
# function with a time method to fill these gaps?

# Let's say the Visitors_per_day column 
# has some missing data, and you want 
# to interpolate missing values but 
# set a limit to how many consecutive NaN values 
# you'd like to fill. How would you use the 
# interpolate() function to achieve this?

In [199]:
# Assume there are some missing values in the Rating_out_of_5 column. 
# How would you use the interpolate() function to fill 
# these NaN values using a linear approach?

df["Rating_out_of_5"][2] = None
df["Rating_out_of_5"][4] = None
df

C:\Users\Administrator.DESKTOP-QSF3VEN\AppData\Local\Temp\ipykernel_14500\3959002649.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Rating_out_of_5"][2] = None
C:\Users\Administrator.DESKTOP-QSF3VEN\AppData\Local\Temp\ipykernel_14500\3959002649.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Rating_out_of_5"][4] = None

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood              4.5               320
1       Diego Drip  San Diego              4.1               290
2      NY Espresso   New York              NaN               500
3      Holly Beans  Hollywood              4.7               330
4    Diego Morning  San Diego              NaN               280
5      NY Caffeine   New York              4.4               520
6    Diego Delight  San Diego              4.2               270

In [200]:
df["Rating_out_of_5"] = df["Rating_out_of_5"].interpolate(method = 'linear')

In [201]:
df

  Coffee_Shop_Name   Location  Rating_out_of_5  Visitors_per_day
0        HollyBrew  Hollywood             4.50               320
1       Diego Drip  San Diego             4.10               290
2      NY Espresso   New York             4.40               500
3      Holly Beans  Hollywood             4.70               330
4    Diego Morning  San Diego             4.55               280
5      NY Caffeine   New York             4.40               520
6    Diego Delight  San Diego             4.20               270

In [202]:
# Interpolate is a complex way of missing values than filling with fillna()